Repository: itmaxdev/mbrcld_portal_v2
Catalog: src/Web/ClientApp/src/locale/*/messages.*.xlf
Languages: ar

source: Back
ar: العودة

source: PERSONAL
ar: الشخصي

source: Nationality
ar: الجنسية

source: Residence country
ar: بلد الإقامة

source: EDUCATION
ar: المؤهلات الدراسية

source: Education:
ar: المؤهلات الدراسية:

source: Current job position
ar: المنصب الوظيفي الحالي

source: Company & industry:
ar: مجال العمل:

source: Select a country
ar: اختار البلد

source: Must be between 8 and 32 characters
ar: يجب أن يكون بين 8 و 32 حرفًا

source: Must contain at least 1 upper case letter [A-Z]
ar: يجب أن يحتوي على حرف واحد كبير على الأقل [A-Z]

source: Must contain at least 1 lower case letter [a-z]
ar: يجب أن يحتوي على حرف واحد صغير على الأقل [a-z]

source: Must contain at least 1 digit [0-9]
ar: يجب أن يحتوي على رقم واحد على الأقل [ ٠-٩]

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Comments
ar: التعليقات

source: Likes
ar: إعجاب

source: "\uFFFD0\uFFFD" People liked this
ar: إعجاب "\uFFFD0\uFFFD"

source: Enter your comment
ar: أضف تعليقاتك هنا

source: Read Comments
ar: التعليقات

source: Live class
ar: الورش المتاحة

source: Start Date
ar: تاريخ البدء

source: Start Date"\uFFFD#83\uFFFD"*"\uFFFD/#83\uFFFD"
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: View Activity
ar: عرض النشاط

source: This field is required
ar: هذه الخانة مطلوبه

source: This is not a valid email
ar: يرجى إدخال عنوان بريد إلكتروني صحيح.

source: This is not a valid url
ar: يرجى إدخال عنوان url صحيح.

source: This should be at least ${requiredLength} characters long
ar: لا يقل عن ${requiredLength} حرفا

source: This should be at most ${requiredLength} characters long
ar: لا يزيد عن ${requiredLength} حرفًا

source: Please provide input in the correct language
ar: يرجى تعبئة البيانات باللغة المطلوبة

source: This is not a valid phone number
ar: هذا الرقم غير صحيح

source: Please check the current value
ar: يرجى التحقق من القيمة الحالية

source: Choose
ar: اختر

source: Upload
ar: تحميل

source: Cancel
ar: إلغاء

source: {0}: Invalid file size,
ar: {0}: حجم الملف غير صالح,

source: maximum upload size is {0}.
ar: أقصى حجم للتحميل هو {0}.

source: {0}: Invalid file type,
ar: {0}: نوع الملف غير صالح ،

source: allowed file types: {0}.
ar: أنواع الملفات المسموح بها: {0}.

source: Maximum number of files exceeded,
ar: تم تجاوز الحد الأقصى لعدد الملفات ،

source: limit is {0} at most.
ar: الحد الأقصى {0} على الأكثر.

source: Today
ar: اليوم

source: Clear
ar: حذف

source: Yes
ar: نعم

source: No
ar: كلا

source: Email already taken
ar: البريد الالكتروني مستخدم من قبل

source: The email 'email' is already taken
ar: البريد الإلكتروني 'email' مستخدم من قبل

source: Registration failed
ar: لم نتمكن من التسجيل

source: We were unable to complete the registration at this time. Please try again later.
ar: لم نتمكن من تسجيل دخولك في هذا الوقت. الرجاء المحاولة في وقت لاحق.

source: Sign Up
ar: التسجيل

source: Nationality *
ar: الجنسية *

source: First Name *
ar: الاسم الاول *

source: Enter the first name
ar: أدخل الاسم الأول

source: Last Name *
ar: اسم العائلة *

source: Enter the first name here
ar: أدخل الاسم الأول هنا

source: Email *
ar: البريد الإلكتروني *

source: Enter email here
ar: أدخل البريد الإلكتروني هنا

source: Mobile Phone *
ar: الهاتف المتحرك *

source: Password *
ar: كلمه السر *

source: Enter password here
ar: أدخل كلمة السر هنا

source: Confirm Password *
ar: تأكيد كلمة السر *

source: Confirm password
ar: تأكيد كلمة السر

source: Emirates ID Number
ar: رقم الهوية الوطنية

source: Sign up
ar: التسجيل

source: Or
ar: أو

source: Sign in with UAE PASS
ar: تسجيل الدخول بالهوية الرقمية

source: Already have an account? "\uFFFD#69\uFFFD"Login"\uFFFD/#69\uFFFD"
ar: هل لديك حساب؟ "\uFFFD#64\uFFFD" تسجيل الدخول "\uFFFD/#64\uFFFD"

source: (Optional)
ar: (اختياري)

source: Confirm your email
ar: قم بتأكيد بريدك الإلكتروني

source: We need to confirm your email address.
ar: نحن نحتاج إلى تأكيد عنوان بريدك الإلكتروني.

source: To complete the registration process, you will receive a verification email to activate your account."\uFFFD#7\uFFFD\uFFFD/#7\uFFFD" If you do not receive the verification email shortly, please contact "\uFFFD#8\uFFFD"info@mbrcld.ae"\uFFFD/#8\uFFFD"
ar: لإكمال عملية التسجيل ، ستتلقى بريدًا إلكترونيًا للتحقق من تفعيل حسابك. "\uFFFD#7\uFFFD\uFFFD/#7\uFFFD" إذا لم تستلم رسالة التفعيل قريبًا ، فيرجى التواصل مع مركز الأتصال "\uFFFD#8\uFFFD"info@mbrcld.ae"\uFFFD/#8\uFFFD"

source: We have sent you an email!
ar: لقد أرسلنا لك بريدًا إلكترونيًا!

source: Reset Password
ar: إعادة تعيين كلمه السر

source: Enter email
ar: أدخل البريد الإلكتروني

source: Invalid email or password
ar: يرجى التحقق من البريد الألكترونى او كلمة السر

source: Creating "\uFFFD#15\uFFFD"LEADERS"\uFFFD/#15\uFFFD" for Tomorrow.
ar: إعداد"\uFFFD#15\uFFFD" قادة "\uFFFD/#15\uFFFD"الغد

source: Login Failed
ar: "يوجد خطأ فى عملية الدخول يرجى التحقق من البريد الألكترونى او كلمة السر"

source: We were unable to log you in at this time. Please try again later.
ar: لم نتمكن من تسجيل دخولك في هذا الوقت. الرجاء المحاولة في وقت لاحق.

source: Login
ar: تسجيل الدخول

source: Enter password
ar: أدخل كلمة السر

source: Sign in with UAE PASS
ar: تسجيل الدخول بالهوية الرقمية

source: Don't have an account? "\uFFFD#49\uFFFD"Sign up"\uFFFD/#49\uFFFD"
ar: هل لديك حساب؟ "\uFFFD#34\uFFFD"إنشاء حساب"\uFFFD/#34\uFFFD"

source: Don't have an account? "\uFFFD#49\uFFFD"Sign up"\uFFFD/#49\uFFFD"
ar: هل لديك حساب؟ "\uFFFD#34\uFFFD"إنشاء حساب"\uFFFD/#34\uFFFD"

source: Forgot your password? "\uFFFD#52\uFFFD"Reset Password"\uFFFD/#52\uFFFD"
ar: نسيت كلمة السر؟ "\uFFFD#37\uFFFD"إعادة تعيين كلمه السر"\uFFFD/#37\uFFFD"

source: Forgot your password? "\uFFFD#52\uFFFD"Reset Password"\uFFFD/#52\uFFFD"
ar: نسيت كلمة السر؟ "\uFFFD#37\uFFFD"إعادة تعيين كلمه السر"\uFFFD/#37\uFFFD"

source: View Applicant
ar: عرض معلومات الطالب:

source: List of Related Users
ar: قائمة المستخدمين ذوي الصلة

source: General Information
ar: بيانات عامة

source: Team
ar: فريق العمل

source: Contact Details
ar: بيانات الاتصال

source: Identity
ar: بيانات الهوية

source: Professional Experience
ar: بيانات الخبرات المهنية

source: Education
ar: المؤهلات الدراسية

source: Training Courses
ar: الدورات التدريبية

source: Memberships
ar: العضويات

source: Learning Preferences
ar: خيارات التعلم

source: Languages
ar: اللغات

source: Skills & Hobbies
ar: المهارات والهوايات

source: About Yourself
ar: معلومات عامة عن نفسك

source: About University
ar: معلومات عامة عن الجامعة

source: Home
ar: الصفحة الرئيسية

source: My Profile
ar: البيانات الشخصية

source: Articles
ar: المقالات

source: Events
ar: الفعاليات

source: Programs
ar: البرامج

source: Dashboard
ar: لوحة المعلومات

source: Calendar
ar: التقويم

source: Survey
ar: التقييمات

source: Profile
ar: ملفي الشخصي

source: Applicants Profile
ar: عرض معلومات المنتسبين

source: Attendance
ar: الحضور

source: Back to main page
ar: العودة إلى الصفحة الرئيسية

source: Change Email
ar: تغيير البريد الالكتروني

source: Change Password
ar: تغيير كلمة السر

source: Logout
ar: تسجيل خروج

source: Update Profile Picture
ar: تحديث صورة الملف الشخصي

source: Confirmation
ar: تأكيد

source: Search
ar: بحث

source: Welcome to MBRCLD
ar: مرحبًا بكم في مركز محمد بن راشد لإعداد القادة

source: “Leaders’ titles are not a source of pride, as they will not endure. Only bringing benefit to the people justifies pride and allows it to endure.”
ar: ”يزيد شرف القائد الحكومي ومكانته، بمقدار منفعته للناس، وليس بمقدار منصبه. ولا تعتز بمنصبك فهو زائل، ويبقى ما ينفع للناس.“

source: HH Sheikh Mohammed Bin Rashid Al Maktoum
ar: الشيخ محمد بن راشد آل مكتوم

source: You haven't selected applicant yet
ar: اختر شخصاً

source: Back to Modules
ar: العودة إلى المساقات

source: Overview
ar: نظرة عامة

source: Save Overview
ar: حفظ

source: Materials
ar: المواد

source: Accelerated Project
ar: مشروع المساق

source: Submitted Project
ar: المشاريع المقدمة

source: Class List
ar: قائمة الطلاب

source: Location "\uFFFD#71\uFFFD"*"\uFFFD/#71\uFFFD"
ar: الموقع *

source: Enter Location
ar: أدخل الموقع

source: Duration (Minutes) "\uFFFD#88\uFFFD"*"\uFFFD/#88\uFFFD"
ar: المدة *

source: Enter Duration
ar: المدة

source: Order "\uFFFD#96\uFFFD"*"\uFFFD/#96\uFFFD"
ar: الترتيب *

source: Enter Order
ar: أدخل الترتيب

source: No MATERIALS Added
ar: لم يتم إضافة مواد

source: No ACCELERATED PROJECTS Added
ar: لم تقم بأضافة مشروع المساق

source: Add Accelerated Project
ar: إضافة مشروع المساق

source: No SUBMITTED PROJECTS Added
ar: لم يتم إضافة أي مشاريع

source: Save
ar: حفظ

source: University Profile
ar: ملف الجامعة الشخصي

source: Team
ar: فريق العمل

source: Live Classes
ar: الورش المتاحة

source: Overview is empty!
ar: لا يوجد!

source: You haven’t add any materials yet
ar: لم يتم إضافة مواد

source: University Name
ar: إسم الجامعة

source: Instructor Name
ar: اسم المحاضر

source: Address
ar: العنوان

source: City
ar: المدينة

source: Instagram
ar: إنستغرام

source: LinkedIn
ar: لينكد إن

source: PoBox
ar: صندوق البريد

source: Twitter
ar: تويتر

source: Website URL
ar: الموقع الإلكتروني

source: Module Team
ar: فريق العمل

source: Back to Materials
ar: العودة إلى المواد

source: Add Section
ar: أضف قسم

source: No SECTIONS Added
ar: لم يتم إضافة أقسام

source: Add Section Content
ar: أضف محتوى القسم

source: Add
ar: اضف

source: Live Preview
ar: المعاينة

source: Add Member
ar: أضف عضو

source: First Name "\uFFFD#14\uFFFD"*"\uFFFD/#14\uFFFD"
ar: الاسم الأول *

source: Enter First Name
ar: أدخل الاسم الأول

source: Last Name "\uFFFD#21\uFFFD"*"\uFFFD/#21\uFFFD"
ar: اسم العائلة *

source: Enter Last Name
ar: أدخل اسم العائلة

source: Job Position "\uFFFD#28\uFFFD"*"\uFFFD/#28\uFFFD"
ar: المنصب الوظيفي *

source: Enter Job Position
ar: أدخل المنصب الوظيفي

source: Education "\uFFFD#35\uFFFD"*"\uFFFD/#35\uFFFD"
ar: المؤهلات الدراسية *

source: Education
ar: المؤهلات الدراسية

source: Residence country "\uFFFD#55\uFFFD"*"\uFFFD/#55\uFFFD"
ar: بلد الإقامة *

source: Nationality "\uFFFD#61\uFFFD"*"\uFFFD/#61\uFFFD"
ar: الجنسية *

source: Image "\uFFFD#67\uFFFD"*"\uFFFD/#67\uFFFD"
ar: الصورة *

source: About Member "\uFFFD#73\uFFFD"*"\uFFFD/#73\uFFFD"
ar: معلومات عن الفريق *

source: About Member
ar: معلومات عن الفريق

source: Email "\uFFFD#114\uFFFD"*"\uFFFD/#114\uFFFD"
ar: بريد إلكتروني *

source: Image
ar: الصورة

source: This section requires you to add the Module Team members.
ar: يتطلب هذا القسم تقديم معلومات عامة عن فريق العمل.

source: Mr
ar: السيد

source: Miss
ar: الآنسة

source: Mrs
ar: السيدة

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Single
ar: أعزب

source: Married
ar: متزوج

source: Profile Avatar
ar: صورة الملف الشخصي

source: Profile photo is required.
ar: صورة الملف الشخصي مطلوبة.

source: General Information
ar: بيانات عامة

source: This section requires you to provide general information about yourself.
ar: يتطلب هذا القسم تقديم معلومات عامة عنك.

source: Gender "\uFFFD#51\uFFFD"*"\uFFFD/#51\uFFFD"
ar: الجنس "\uFFFD#44\uFFFD"*"\uFFFD/#44\uFFFD"

source: Enter gender
ar: أختار الجنس

source: Marital Status
ar: الحالة الإجتماعية

source: Select Marital Status
ar: أختار الحالة الاجتماعية

source: Date of Birth "\uFFFD#64\uFFFD"*"\uFFFD/#64\uFFFD"
ar: تاريخ الميلاد "\uFFFD#55\uFFFD"*"\uFFFD/#55\uFFFD"

source: Enter date of birth
ar: أدخل تاريخ الميلاد

source: Next
ar: التالى

source: Ok
ar: تأكيد

source: About University
ar: معلومات عن الجامعة

source: This section requires you to provide an introduction about the university you represent
ar: يتطلب منك هذا القسم إضافة معلومات عن الجامعة

source: Modules
ar: المساقات

source: Link:(To be announced 15 mins before time)
ar: الرابط

source: Duration: "\uFFFD0\uFFFD" Mins
ar: المدة

source: Date: "\uFFFD0\uFFFD", (GMT+4)
ar: التاريخ

source: Coming Soon
ar: قريبا

source: Explore new topics and courses that might interest you!
ar: اكتشف الموضوعات والدورات الجديدة التي قد تهمك!

source: Add To Calendar
ar: أضف إلى التقويم

source: Surveys List
ar: التقييمات

source: No Surveys yet!
ar: لا توجد إستبيانات متاحة

source: Go Back
ar: العودة

source: Edit Article
ar: تعديل المقال

source: Add Article
ar: إضافة مقال

source: Article Name
ar: عنوان المقال

source: Enter the article name here
ar: أدخل عنوان المقال

source: Article Description
ar: معلومات عن المقال

source: Enter the description of the articel
ar: أدخل موضوع المقال

source: Article Small Photo
ar: صورة المقال

source: Enter the article cover photo
ar: أدخل صورة المقال الرئيسية

source: Upload
ar: تحميل

source: Article Cover Photo
ar: صورة المقال الرئيسية

source: Enter the article small photo
ar: أدخل صورة المقال الصغيرة

source: Save as Draft
ar: حفظ كمسودة

source: Send for Approval
ar: ارسل للموافقة

source: All Articles
ar: جميع المقالات

source: My Articles
ar: مقالاتي

source: Add New Article
ar: إضافة مقال

source: Invalid email
ar: بريد إلكتروني خاطئ

source: This email is not available
ar: هذا البريد الإلكتروني غير متوفر

source: Change Email
ar: تغيير البريد الإلكتروني

source: We have sent you an email!
ar: لقد أرسلنا لك بريدًا إلكترونيًا!

source: Enter Email
ar: أدخل البريد الإلكتروني

source: Submit
ar: حفظ

source: Go Home
ar: الذهاب إلى الصفحة الرئيسية

source: Wrong Password
ar: كلمة السر خاطئة

source: The Old Password you entered is wrong.
ar: كلمة السر الحالية التي أدخلتها خاطئة.

source: Change Password
ar: تغيير كلمة السر

source: Your password has been changed!
ar: تم تغيير كلمة السر الخاصة بك!

source: Old Password *
ar: كلمة السر الحالية *

source: Enter Old Password
ar: أدخل كلمة السر الحالية

source: New Password *
ar: كلمة السر الجديدة *

source: Enter New Password
ar: أدخل كلمة السر الجديدة

source: Confirm New Password *
ar: تأكيد كلمة السر الجديدة *

source: Re-Enter New Password
ar: أعد إدخال كلمة السر الجديدة

source: Forgot your old password? "\uFFFD#23\uFFFD"Reset Password"\uFFFD/#23\uFFFD"
ar: نسيت كلمة السر القديمة ؟ "\uFFFD#37\uFFFD"إعادة تعيين كلمه السر"\uFFFD/#37\uFFFD"

source: Go Back
ar: العودة

source: Video Title "\uFFFD#16\uFFFD"*"\uFFFD/#16\uFFFD"
ar: عنوان الفيديو *

source: Enter Video Title
ar: أدخل عنوان الفيديو

source: Upload Video
ar: تحميل الفيديو

source: Please Upload a video
ar: الرجاء تحميل الفيديو

source: Title "\uFFFD#14\uFFFD"*"\uFFFD/#14\uFFFD"
ar: العنوان *

source: Enter Title
ar: أدخل العنوان

source: Meeting Link "\uFFFD#22\uFFFD"*"\uFFFD/#22\uFFFD"
ar: رابط الورشة *

source: Meeting Link
ar: رابط الورشة

source: Duration
ar: المدة

source: Meeting Date "\uFFFD#45\uFFFD"*"\uFFFD/#45\uFFFD"
ar: موعد الورشة

source: Enter Date
ar: أدخل التاريخ

source: Go Back
ar: العودة

source: Edit Group Project
ar: تعديل المشروع الجماعي

source: Summary
ar: ملخص

source: Download Attachment
ar: تنزيل الملف

source: Topic "\uFFFD#3\uFFFD"*"\uFFFD/#3\uFFFD"
ar: المحور *

source: Select a Topic
ar: إختر المحور

source: Yes
ar: نعم

source: No
ar: كلا

source: Form saved successfully
ar: تم حفظ النموذج بنجاح

source: Questions
ar: اسئلة للمرشح

source: This section requires you to answer specific questions for the program.
ar: المطلوب تقديم أجوبة لأسئلة خاصة بالبرنامج.

source: Back
ar: العودة

# smartAssessmentRecommendation
source: We recommend you dedicate 30 minutes to complete this assessment on your computer or phone (not a tablet). pymetrics is designed to be fun and simple, there is no right or wrong answer, and after you finish you will receive a personalized report with insight into your behaviors. For any technical questions relating to accessing pymetrics or completing the assessment, please reach out directly to the pymetrics Helpdesk at support@pymetrics.com.
ar: ننصح بتخصيص 30 دقيقة لإكمال هذا التقييم على جهاز الكمبيوتر أو الهاتف المحمول (وليس الجهاز اللوحي). تم تصميم pymetrics ليكون ممتعًا وبسيطًا، ولا يوجد إجابة صحيحة أو خاطئة. بعد الانتهاء ستتلقى تقريرًا شخصيًا يقدم نظرة عميقة على سلوكياتك. بالنسبة لأي أسئلة تقنية تتعلق بالوصول إلى pymetrics أو إكمال التقييم، يرجى التواصل مباشرة مع فريق دعم pymetrics على support@pymetrics.com.

source: Please Note:
ar: يرجى ملاحظة ما يلي:

source: - If you already have a pymetrics account under this email address for a different application or company, you should follow the link above, and login with your existing account. Please do not make a new account."\uFFFD#9\uFFFD\uFFFD/#9\uFFFD" - If you played pymetrics less than 330 days ago, you are not required to replay the exercises. Please login and follow the prompts to resubmit existing data, which will be re-assessed against the role profile to which you’ve applied.
ar: - إذا كان لديك حساب pymetrics استخدام نفس الحساب الحالي ، يجب عليك اتباع الرابط أعلاه وتسجيل الدخول باستخدام حسابك الحالي. يرجى عدم إنشاء حساب جديد."\uFFFD#9\uFFFD\uFFFD/#9\uFFFD"- إذا قمت بلعب pymetrics قبل أقل من 330 يومًا، فليس عليك إعادة تكرار التمارين. يرجى تسجيل الدخول واتباع التعليمات لإعادة إرسال البيانات الحالية التي ستُعيد تقييمها بناءً على ملف الوظيفة التي قدمت إليها.

source: Start Assessment
ar: التقييم الذكي

source: We are working on it. Please try again in a few minutes.
ar: نحن نعمل على حل المشكلة. يرجى المحاولة مرة أخرى

source: Please allow minimum of 5 minutes for the assessment results to be reflected on the system.
ar: يرجى الأنتظار خمس دقائق على الأقل حتى تنعكس نتائج التقييم على النظام.

source: About Yourself
ar: معلومات عامة عن نفسك

source: This section requires you to provide an introduction about yourself
ar: يتطلب منك هذا القسم إضافة معلومات عنك

source: Are you sure?
ar: هل انت متأكد ؟

source: Physical Workshops
ar: ورش عمل

source: One to One (Mentor)
ar: واحد الى واحد (مرشد)

source: Books
ar: كتب

source: Videos
ar: فيديو

source: E-Books
ar: الكتب الإلكترونية

source: Class
ar: صف دراسي

source: Group
ar: مجموعات

source: Audiobooks
ar: الكتب الصوتية

source: Articles
ar: المقالات

source: Online
ar: عبر الانترنت

source: Learning Preferences
ar: خيارات التعلم

source: This sections requires you to select your learning preferences.
ar: يتطلب هذا القسم تحديد خيارات التعلم الخاصة بك.

source: Select your learning preferences
ar: اختر خيارات التعلم الخاصة بك

source: Less than 50K AED
ar: أقل من 50 ألف درهم إماراتي

source: 50K – 100K AED
ar: 50 ألف إلى 100 ألف درهم إماراتي

source: 100K – 500K AED
ar: 100 ألف - 500 ألف درهم إماراتي

source: More than 500K AED
ar: أكثر من 500 ألف درهم إماراتي

source: Other
ar: أخرى

source: A Function
ar: وظيفة أو دور

source: A Team
ar: فريق العمل

source: The Organization
ar: جهة العمل

source: The City or Country
ar: الدوله أو المدينة

source: Add Achievement
ar: أضافة إنجاز

source: Population Impacted "\uFFFD#35\uFFFD"*"\uFFFD/#35\uFFFD"
ar: المجموعات المتأثرة "\uFFFD#31\uFFFD"*"\uFFFD/#31\uFFFD"

source: Select Population Impacted
ar: المجموعات المتأثرة

source: Financial Impact "\uFFFD#42\uFFFD"*"\uFFFD/#42\uFFFD"
ar: الأثر الأقتصادي "\uFFFD#38\uFFFD"*"\uFFFD/#38\uFFFD"

source: Select Financial Impact
ar: الأثر الأقتصادي

source: Year of achievement "\uFFFD#63\uFFFD"*"\uFFFD/#63\uFFFD"
ar: عام تحقيق الأنجاز "\uFFFD#57\uFFFD"*"\uFFFD/#57\uFFFD"

source: Select Year Of Achievement
ar: عام تحقيق الأنجاز

source: Achievements
ar: الإنجازات

source: This section requires you to provide your top 3 career specific achievements within your career history.
ar: المطلوب تقديم أبرز إنجازاتك المهنية ضمن مسيرتك المهنية بحد أدنى إنجاز واحد وبحد أقصى 3 إنجازات

source: You haven't added any achievements yet
ar: لم تقم بإضافة أي إنجازات حتى الآن

source: Year Of Achievement
ar: عام تحقيق الأنجاز

source: Go Back
ar: العودة

source: List of Applicants
ar: لائحة المنتسبين

source: All Messages
ar: جميع الرسائل

source: Send
ar: إرسال

source: Write a message
ar: إدخل الرسالة

source: Files
ar: الملفات

source: No messages yet
ar: لا يوجد محادثات

source: No attachments yet
ar: لم تقم بأضافة مرفقات

source: Create Chat With Instructor
ar: إنشاء محادثة مع المحاضر

source: Create New Chat
ar: إنشاء محادثة جديدة

source: Enter Room Name
ar: أدخل عنوان غرفة المحادثة

source: Create
ar: إنشاء

source: Cancel
ar: الغاء

source: This section requires you to provide general information about the university.
ar: يتطلب منك هذا القسم إضافة معلومات عن الجامعة

source: Name "\uFFFD#7\uFFFD"*"\uFFFD/#7\uFFFD"
ar: الاسم *

source: Enter name
ar: أدخل الاسم

source: About University "\uFFFD#14\uFFFD"*"\uFFFD/#14\uFFFD"
ar: معلومات عن الجامعة *

source: Country "\uFFFD#28\uFFFD"*"\uFFFD/#28\uFFFD"
ar: البلد *

source: City "\uFFFD#34\uFFFD"*"\uFFFD/#34\uFFFD"
ar: المدينة *

source: Enter city
ar: أدخل المدينة

source: Address "\uFFFD#41\uFFFD"*"\uFFFD/#41\uFFFD"
ar: العنوان *

source: Enter address
ar: أدخل العنوان

source: Phone "\uFFFD#48\uFFFD"*"\uFFFD/#48\uFFFD"
ar: الهاتف *

source: Enter phone number
ar: أدخل الهاتف

source: POBOX "\uFFFD#55\uFFFD"*"\uFFFD/#55\uFFFD"
ar: الصندوق البريدي *

source: Enter post office box
ar: أدخل الصندوق البريدي

source: LinkedIn "\uFFFD#62\uFFFD"*"\uFFFD/#62\uFFFD"
ar: لينكد إن *

source: Enter linkedIn url
ar: أدخل لينكد إن

source: Twitter "\uFFFD#69\uFFFD"*"\uFFFD/#69\uFFFD"
ar: تويتر *

source: Enter twitter url
ar: أدخل تويتر

source: Instagram "\uFFFD#76\uFFFD"*"\uFFFD/#76\uFFFD"
ar: إنستغرام *

source: Enter instagram url
ar: أدخل إنستغرام

source: Website URL "\uFFFD#83\uFFFD"*"\uFFFD/#83\uFFFD"
ar: الموقع الإلكتروني *

source: Enter website url
ar: أدخل الموقع الإلكتروني

source: Edit Project
ar: تعديل المشروع

source: Add Attachment
ar: إضافة مرفق

source: Save As Draft
ar: حفظ كمسودة

source: This activity has yet to be attempted.
ar: لم أبدأ بعد

source: You have marked this for review. Remember to come back to it when you have time
ar: لم تقم بإنهاء المراجعة. تذكر أن تعود إليها عندما يكون لديك الوقت

source: Good work, you have marked this activity as complete.
ar: مكتمل

source: Back to Sections
ar: العودة إلى الأقسام

source: Add Content
ar: إضافة محتوى

source: Unread
ar: غير مقروء

source: Review
ar: قيد المراجعة

source: Done
ar: مكتمل

source: Attachment Title "\uFFFD#14\uFFFD"*"\uFFFD/#14\uFFFD"
ar: عنوان المرفق *

source: Enter Attachment Title
ar: أدخل عنوان المرفق

source: Back to Programs
ar: العودة إلى البرامج

source: % Completed
ar: % مكتمل

source: Impactful Leaders Program
ar: برنامج القيادات المؤثرة

source: It is the vision of the Mohammed Bin Rashid Center for Leadership Development to create leaders for tomorrow’s world. To achieve this vision, the Center is launching its flagship program first. This program is designed to be an avant-garde experience that challenges leaders to move outside their comfort zone. It is a journey rather than an event, which will leave the participants being more effective at the end of the program. The curriculum is based on the Mohammed Bin Rashid Al Maktoum Competency Model and is delivered by a consortium of the world’s leading providers of executive education. The modules of the program have been carefully curated and contextualized to be readily applicable to the local context.
ar: تهدف رؤية مركز محمد بن راشد لإعداد القادة إلى خلق قيادات لعالم الغد؛ ولتحقيق هذه الرؤية قام المركز بإطلاق أول برنامج قيادي ضمن استراتيجيته الجديدة. تم تصميم البرنامج بناء على أحدث الأساليب لتطوير القيادات حيث سيقوم بتحدي القيادات الوطنية ودفعهم نحو استكشاف مدى إمكانياتهم. تم تطوير محتوى البرنامج بناءً على منظومة محمد بن راشد للقيادة ويتم تنفيذ البرنامج بالتعاون مع أبرز المؤسسات الاكاديمية الدولية. وقد قام المركز بتطوير مساقات البرنامج بناءً على متطلبات دولة الإمارات في المرحلة القادمة، بالإضافة إلى أحدث الدراسات في مجال القيادة.

source: Add Reference
ar: إضافة مرجع

source: Mobile "\uFFFD#21\uFFFD"*"\uFFFD/#21\uFFFD"
ar: الهاتف المتحرك "\uFFFD#19\uFFFD"*"\uFFFD/#19\uFFFD"

source: References
ar: المراجع
