Repository: itmaxdev/mbrcld_portal_v2
Catalog: src/Web/ClientApp/src/locale/*/messages.*.xlf
Languages: ar

source: This section requires you to provide a minimum of 1 and a maximum of 3 work-related references. Once you save a reference, an e-mail will be sent to the referee immediately. You may follow the status of your referees’ submissions as long as the registration phase is open. This section will not be considered complete until at least one referee completes the questionnaire.
ar: المطلوب تقديم مراجع مهنية (مرجع 1 بحد أدنى و 3 مراجع بحد أقصى). حين يتم الضغط على زر الحفظ سيتم إرسال دعوة إلكترونية للمرجع المعني بشكل فوري. يمكنك متابعة حالة تقديم المرجع لنموذج تسجيلكم خلال فترة فتح باب التسجيل للبرنامج. يتوجب على مرجع واحد على الأقل أن يستكمل نموذج المراجعة الخاص بك ليتم اعتبار هذا الجزء مستكمل لنموذج تسجيلك في البرنامج.

source: You haven't added any references yet
ar: لم يتم إضافة أي مراجع حتى الآن

source: Job Title
ar: المسمى الوظيفي

source: Organization
ar: جهة العمل

source: Mobile
ar: الهاتف المتحرك

source: Email
ar: البريد الإلكتروني

source: Referee Completed
ar: مكتمل

source: Pending Referee
ar: غير مكتمل

source: Achievements
ar: الإنجازات

source: References
ar: المراجع

source: Questions
ar: اسئلة للمرشح

source: Smart Assessment
ar: التقييم الذكي

source: Acknowledgment
ar: تعهد

source: You are already enrolled in this program
ar: قمت بالتسجيل فى هذا البرنامج مسبقا

source: Add Skill
ar: أضف مهاراتك

source: Name
ar: اسم

source: Enter Skill
ar: أضف مهاراتك

source: Skills & Hobbies
ar: المهارات والهوايات

source: This sections requires you to provide your skills and hobbies.
ar: يتطلب منك هذه القسم اضافة مهاراتك وهواياتك.

source: You haven't added any skills or hobbies yet.
ar: لم يتم إضافة أي مهارات أو هوايات بعد.

source: Basic
ar: مبتدأ

source: Intermediate
ar: متوسط

source: Fluent
ar: طلاقة

source: Native
ar: اللغة الأم

source: Invalid operation
ar: عملية غير صحيحة

source: You cannot add the same language more than once
ar: لا يمكن إضافة نفس اللغة أكثر من مرة

source: Add Language
ar: إضافة لغة

source: Language "\uFFFD#9\uFFFD"*"\uFFFD/#9\uFFFD"
ar: اللغة "\uFFFD#9\uFFFD"*"\uFFFD/#9\uFFFD"

source: Select an option
ar: أختر

source: Proficiency "\uFFFD#15\uFFFD"*"\uFFFD/#15\uFFFD"
ar: الكفاءة "\uFFFD#15\uFFFD"*"\uFFFD/#15\uFFFD"

source: Languages
ar: اللغات

source: This sections requires you to provide all your language skills.
ar: المطلوب تقديم بيانات جميع مهاراتك اللغوية.

source: You haven't added any languages yet
ar: لم تقم بإضافة أي لغه حتى الآن

source: Yes
ar: نعم

source: No
ar: كلا

source: Add Membership
ar: أضف عضوية

source: Are you a member in any institution or board?
ar: هل أنت عضو في أي مؤسسة أو مجلس إدارة؟

source: Join Date "\uFFFD#38\uFFFD"*"\uFFFD/#38\uFFFD"
ar: تاريخ الانضمام "\uFFFD#35\uFFFD"*"\uFFFD/#35\uFFFD"

source: Enter Join Date
ar: أدخل تاريخ الانضمام

source: Active "\uFFFD#45\uFFFD"*"\uFFFD/#45\uFFFD"
ar: فعال "\uFFFD#41\uFFFD"*"\uFFFD/#41\uFFFD"

source: Memberships
ar: العضويات

source: This section requires you to provide your memberships and affiliations with occupational or social societies locally or internationally.
ar: المطلوب تقديم عضويتك وعلاقاتك في المؤسسات أو مجالس الإدارة سواء على المستوى المحلي أو الدولي.

source: You haven't added any memberships yet.
ar: لم تقم بإضافة أي عضويه حتى الآن.

source: Join Date
ar: تاريخ الانضمام

source: Active
ar: فعّال

source: Not Active
ar: غير فعّال

source: Add Training Course
ar: اضافة دورة تدريبية

source: Course Name "\uFFFD#8\uFFFD"*"\uFFFD/#8\uFFFD"
ar: اسم الدورة التدريبية "\uFFFD#8\uFFFD"*"\uFFFD/#8\uFFFD"

source: Enter Course Name
ar: أدخل اسم الدورة التدريبية

source: Provider "\uFFFD#15\uFFFD"*"\uFFFD/#15\uFFFD"
ar: مقدم الخدمة "\uFFFD#15\uFFFD"*"\uFFFD/#15\uFFFD"

source: Enter Course Provider Name
ar: أدخل اسم مقدم الخدمة

source: Select a country
ar: اختار البلد

source: Date "\uFFFD#29\uFFFD"*"\uFFFD/#29\uFFFD"
ar: التاريخ "\uFFFD#29\uFFFD"*"\uFFFD/#29\uFFFD"

source: Training Courses
ar: الدورات التدريبية

source: This sections requires you to provide any additional training you have taken (maximum of 3 most recent training programs).
ar: المطلوب تقديم الدورات التدريبية التي أكملتها (بحد أقصى 3 دورات تدريبية)

source: You haven't added any training courses yet.
ar: لم تقم بإضافة أي دورة تدريبية حتى الآن.

source: Country
ar: البلد

source: Graduation Date
ar: تاريخ التخرج

source: Associate
ar: منتسب

source: Bachelor
ar: بكالوريوس

source: Master
ar: ماجيستير

source: Doctoral
ar: دكتوراه

source: Abu Dhabi
ar: أبو ظبي

source: Ajman
ar: عجمان

source: Dubai
ar: دبي

source: Fujairah
ar: الفجيرة

source: Ras Al Khaimah
ar: رأس الخيمة

source: Sharjah
ar: الشارقة

source: Umm al-Quwain
ar: أم القيوين

source: Add Education
ar: أضف المؤهل العلمي

source: Degree "\uFFFD#7\uFFFD"*"\uFFFD/#7\uFFFD"
ar: المؤهل العلمي "\uFFFD#7\uFFFD"*"\uFFFD/#7\uFFFD"

source: Select degree
ar: حدد المؤهل العلمي

source: Graduation Date "\uFFFD#14\uFFFD"*"\uFFFD/#14\uFFFD"
ar: تاريخ التخرج "\uFFFD#45\uFFFD"*"\uFFFD/#45\uFFFD"

source: Enter the Graduation date
ar: أدخل تاريخ التخرج

source: This section requires you to provide your educational qualifications (maximum of 3 most recent academic qualifications).
ar: المطلوب تقديم المؤهلات الدراسية الأكاديمية (أحدث 3 مؤهلات دراسية حصلت عليها).

source: Last Education Certificate Copy "\uFFFD#12\uFFFD"*"\uFFFD/#12\uFFFD"
ar: نسخة من شهادة التعليم الأخيرة "\uFFFD#12\uFFFD"*"\uFFFD/#12\uFFFD"

source: You haven't added any education yet.
ar: لم تقم بإضافة أي مؤهل حتى الآن.

source: "\uFFFD0\uFFFD" in "\uFFFD1\uFFFD"
ar: "\uFFFD0\uFFFD" في "\uFFFD1\uFFFD"

source: Select City
ar: اختار المدينة

source: Enter City
ar: أدخل المدينة

source: Add Professional Experience
ar: أضف الخبرات المهنية

source: Organization Size "\uFFFD#23\uFFFD"*"\uFFFD/#23\uFFFD"
ar: حجم الجهة "\uFFFD#21\uFFFD"*"\uFFFD/#21\uFFFD"

source: Select the organization size
ar: حدد حجم الجهة

source: I am currently working there
ar: انا حاليا اعمل في الجهة

source: From "\uFFFD#50\uFFFD"*"\uFFFD/#50\uFFFD"
ar: من "\uFFFD#46\uFFFD"*"\uFFFD/#46\uFFFD"

source: From
ar: من

source: To
ar: إلى

source: Sector "\uFFFD#63\uFFFD"*"\uFFFD/#63\uFFFD"
ar: قطاع "\uFFFD#58\uFFFD"*"\uFFFD/#58\uFFFD"

source: Select a Sector
ar: اختر قطاع

source: Industry "\uFFFD#70\uFFFD"*"\uFFFD/#70\uFFFD"
ar: مجال العمل "\uFFFD#64\uFFFD"*"\uFFFD/#64\uFFFD"

source: Select an Industry
ar: حدد مجال العمل

source: Professional Experience
ar: بيانات الخبرات المهنية

source: This section requires you to provide your career history (minimum 1 and maximum 3 job posts).
ar: المطلوب تقديم نبذة عن مسيرتكم المهنية مع التركيز على آخر 3 مناصب وظيفية شغلتها.

source: CV Copy "\uFFFD#12\uFFFD"*"\uFFFD/#12\uFFFD"
ar: نسخة السيرة الذاتية "\uFFFD#12\uFFFD"*"\uFFFD/#12\uFFFD"

source: You haven't added any professional experiences yet.
ar: لم تقم بإضافة أي خبرات مهنية حتى الآن.

source: Sector
ar: القطاع

source: Industry
ar: مجال العمل

source: Present
ar: الحالي

source: "\uFFFD#2\uFFFD"Present"\uFFFD/#2\uFFFD"
ar: "\uFFFD#2\uFFFD"الحالي"\uFFFD/#2\uFFFD"

source: Other Sector *
ar: قطاع آخر *

source: Enter Other
ar: إضافة

source: Other Industry *
ar: مجال عمل آخر *

source: You have 1 other current position
ar: لديك منصب حالي آخر

source: Umm Al-Quwian
ar: أمّ القيوين

source: Identity
ar: بيانات الهوية

source: This section requires you to provide all official documents related to your identity.
ar: يطلب منك هذا القسم تقديم جميع المستندات الرسمية المتعلقة بالهوية الوطنية.

source: Enter your Emirates ID expiry date
ar: أدخل تاريخ انتهاء الهوية الوطنية الخاص بك

source: Passport Number "\uFFFD#20\uFFFD"*"\uFFFD/#20\uFFFD"
ar: رقم جواز السفر "\uFFFD#19\uFFFD"*"\uFFFD/#19\uFFFD"

source: Enter passport number
ar: أدخل رقم جواز السفر

source: Passport Expiry Date "\uFFFD#27\uFFFD"*"\uFFFD/#27\uFFFD"
ar: تاريخ انتهاء صلاحيه جواز السفر "\uFFFD#26\uFFFD"*"\uFFFD/#26\uFFFD"

source: Enter your passport expiry date
ar: أدخل تاريخ انتهاء صلاحية جواز سفرك

source: Documents
ar: مستندات

source: Identity Front Page "\uFFFD#38\uFFFD"*"\uFFFD/#38\uFFFD"
ar: صورة الهوية الأمامية "\uFFFD#38\uFFFD"*"\uFFFD/#38\uFFFD"

source: Identity Back Page "\uFFFD#43\uFFFD"*"\uFFFD/#43\uFFFD"
ar: صورة الهوية الخلفية "\uFFFD#43\uFFFD"*"\uFFFD/#43\uFFFD"

source: Passport Front Page "\uFFFD#48\uFFFD"*"\uFFFD/#48\uFFFD"
ar: صورة جواز السفر الأمامية"\uFFFD#48\uFFFD"*"\uFFFD/#48\uFFFD"

source: Passport Back Page "\uFFFD#53\uFFFD"*"\uFFFD/#53\uFFFD"
ar: صورة جواز السفر الخلفية"\uFFFD#53\uFFFD"*"\uFFFD/#53\uFFFD"

source: Family Book Front Page "\uFFFD#58\uFFFD"*"\uFFFD/#58\uFFFD"
ar: صورة خلاصة القيد الأمامية "\uFFFD#58\uFFFD"*"\uFFFD/#58\uFFFD"

source: Family Book Back Page "\uFFFD#63\uFFFD"*"\uFFFD/#63\uFFFD"
ar: صورة خلاصة القيد الخلفية "\uFFFD#63\uFFFD"*"\uFFFD/#63\uFFFD"

source: Emirates ID "\uFFFD*7:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*7:1\uFFFD"
ar: رقم الهوية الإماراتية "\uFFFD*6:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*6:1\uFFFD"

source: Emirates ID Expiry Date "\uFFFD*13:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*13:1\uFFFD"
ar: تاريخ انتهاء الهوية الوطنية"\uFFFD*12:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*12:1\uFFFD"

source: Emirates ID Expiry Date "\uFFFD*14:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*14:1\uFFFD"
ar: تاريخ انتهاء الهوية الوطنية"\uFFFD*14:1\uFFFD\uFFFD#1:1\uFFFD""\uFFFD#2:1\uFFFD"*"\uFFFD/#2:1\uFFFD""\uFFFD/#1:1\uFFFD\uFFFD/*14:1\uFFFD"

source: Passport Issuing Authority "\uFFFD#3\uFFFD"*"\uFFFD/#3\uFFFD"
ar: جهة إصدار الجوازات "\uFFFD#3\uFFFD"*"\uFFFD/#3\uFFFD"

source: Passport Issuing Authority "\uFFFD#3\uFFFD"*"\uFFFD/#3\uFFFD"
ar: جهة إصدار الجوازات "\uFFFD#3\uFFFD"*"\uFFFD/#3\uFFFD"

source: Select your passport issuing authority
ar: حدد جهة إصدار جواز السفر الخاص بك

source: Contact Details
ar: بيانات الاتصال

source: This section requires you to provide your contact details so we may ensure communication with you.
ar: المطلوب تقديم بيانات التواصل الخاصة بك لتأكيد التواصل الفعال بينك وبين المركز.

source: Personal Email "\uFFFD#8\uFFFD"*"\uFFFD/#8\uFFFD"
ar: البريد الإلكتروني الشخصي "\uFFFD#8\uFFFD"*"\uFFFD/#8\uFFFD"

source: Work Email "\uFFFD#19\uFFFD"*"\uFFFD/#19\uFFFD"
ar: البريد الإلكتروني - العمل "\uFFFD#18\uFFFD"*"\uFFFD/#18\uFFFD"

source: Enter business email
ar: أدخل البريد الإلكتروني - العمل

source: Second Mobile
ar: الهاتف المتحرك الثاني

source: Landline
ar: الهاتف الارضي

source: Enter Telephone
ar: أدخل الهاتف

source: Residence Country "\uFFFD#44\uFFFD"*"\uFFFD/#44\uFFFD"
ar: بلد الإقامة"\uFFFD#41\uFFFD"*"\uFFFD/#41\uFFFD"

source: Enter country of residence
ar: أدخل بلد الإقامة

source: Enter Address
ar: أدخل العنوان

source: P.O. Box
ar: صندوق البريد

source: Enter P.O. Box
ar: أدخل صندوق البريد

source: Social Media Accounts
ar: حسابات وسائل التواصل الاجتماعي

source: This section requires you to provide your social media accounts on three major platforms (namely LinkedIn, Instagram and Twitter) which you are active on.
ar: المطلوب تقديم حسابات التواصل الاجتماعي الخاصة بكم والفعالة لثلاث منصات رئيسية (LinkedIn و Instagram و Twitter).

source: Enter linkedIn
ar: أدخل linkedIn

source: Enter twitter
ar: أدخل Twitter

source: Enter instagram
ar: أدخل instagram

source: You must provide at least 1 social media account
ar: يجب عليك اضافة حساب واحد في وسائل التواصل الاجتماعي على الأقل

source: Program - Leadership program
ar: برنامج القيادات المؤثرة

source: In Progress Projects
ar: مشاريع قيد التنفيذ

source: Completed Projects
ar: المشاريع المكتملة

source: Grouped Projects
ar: مشاريع جماعية

source: Search courses
ar: بحث

source: Explore new topics and courses that might interest you!
ar: اكتشف الموضوعات والدورات الجديدة التي قد تهمك!

source: Complete your profile
ar: أكمل ملفك الشخصي

source: Enroll
ar: تسجيل

source: Missing information
ar: معلومات غير مكتملة

source: Please fill in all the required information then try again
ar: يرجى ملء جميع المعلومات المطلوبة ثم المحاولة مرة أخرى

source: Acknowledgment
ar: تعهد

source: This section requires you to confirm that all your entries are valid, accurate and updated. Once you click submit you will no longer be able to make any edits to your registration form (except the References section).
ar: المطلوب تأكيد صحة ودقة وحداثة البيانات التي قدمتها في نموذج التسجيل. بعد الضغط على زر التقديم لا يمكنك تعديل أي جزء من الاستمارة إلا جزئية المراجع.

source: I hereby declare that the information provided in this form is true to the best of my knowledge and belief. And that I understand it is for use as selection criteria for the MBRCLD program. I understand the misrepresentation of information in this form will lead to disqualification from the application process and that I will be debarred from participation in the future programs of the MBRCLD.
ar: اتعهد بأن كافة المعلومات و البيانات التي تم تقديمها في هذا النموذج صحيحة و دقيقة لأغراض معايير اختيار منتسبين لبرنامج لدى مركز محمد بن راشد لإعداد القادة. و أتحمل المسؤولية الكاملة عن أي انتهاك أو تجاوز سيؤدي إلى عدم تأهيلي للبرنامج و أنه سيتم منعي من التقديم لبرامج أخرى لدى المركز في المستقبل.

source: I agree to the MBRCLD Terms
ar: أوافق على شروط مركز محمد بن راشد لأعداد القادة

source: Finish
ar: إنهاء

source: Congratulations
ar: تهانينا

source: DUE
ar: تاريخ الاستحقاق

source: Status
ar: الحالة

source: Status"\uFFFD#6\uFFFD"*"\uFFFD/#6\uFFFD"
ar: الحالة

source: Status
ar: الحالة

source: User cancelled the Login
ar: إلغاء تسجيل الدخول

source: Knowledge Hub
ar: موقع المعرفة

source: Idea Hub
ar: مختبر الأفكار

source: Meeting Hub
ar: لقاءات ونقاشات

source: Elite Club
ar: نادي قادة دبي

source: Current job position:
ar: المنصب الوظيفي الحالي:

source: Back to Modules
ar: العودة إلى المساقات

source: Duration "\uFFFD#30\uFFFD"*"\uFFFD/#30\uFFFD"
ar: المدة

source: Back to Ideas
ar: العودة

source: Enter the name here
ar: الاسم

source: Description
ar: الموضوع

source: Enter the description of the idea
ar: موضوع الفكرة

source: Body
ar: نص المقال

source: AED
ar: الميزانية

source: Benchmark
ar: المعيار

source: Elite Communication
ar: تواصل النخبة

source: Designing and applying special projects
ar: فرص تصميم وتقديم مشاريع خاصة

source: Mentor by Dubai leaders
ar: موجه من قيادات دبي

source: Eliteclub
ar: نادي قادة دبي

source: Elite Membership
ar: عضوية المشاركات الشاملة

source: Individual Development Membership
ar: عضوية التطوير الفردي

source: Elite Club members
ar: أعضاء نادي قادة دبي

source: You haven't added any skills or hobbies yet.
ar: لم يتم إضافة أي مهارات أو هوايات بعد.

source: Add New Special Project
ar: اضافة مشروع خاص

source: Panel discussions
ar: حلقات نقاشية مع قيادات محلية و عالمية

source: Consulting forums and workshop
ar: منتديات استشارية وورشة عمل

source: Idea Lab
ar: مختبر الأفكار

source: Not attending
ar: لن أشارك

source: Attending
ar: سوف أشارك

source: Mentor information
ar: معلومات المرشد

source: Ideas
ar: الأفكار

source: Idea Hub
ar: أضف فكرة جديدة

source: Go Back
ar: العودة

source: You haven't added any achievements yet
ar: لم تقم بإضافة أي إنجازات حتى الآن

source: You haven't added any references yet
ar: لم تقم بإضافة أي مؤهل حتى الآن.

source: Suggested Projects
ar: المشاريع المقترحة

source: In Progress Programs
ar: برامج قيد العمل

source: Completed Programs
ar: البرامج المكتملة

source: This is where you can find groups of people who share your interests where you could discuss your ideas with
ar: يمكنك البحث عن الأشخاص الذين يشاركونك اهتماماتك ويمكنك مناقشة أفكارك معهم

source: Start
ar: البدء

source: Surveys
ar: التقييمات

source: Program Evaluation
ar: تقييم البرنامج

source: View Details
ar: عرض التفاصيل

source: Select a Program
ar: إختر البرنامج

source: Select a Cohort Year
ar: إختر السنة

source: No user searched yet!
ar: لا يوجد نتائج!

source: Decline
ar: لا ارغب

source: Accept
ar: ارغب

source: Suggested Programs
ar: البرامج المقترحة

source: Add New Idea
ar: أضف فكرة

source: User Manual
ar: دليل المستخدم

source: New Programs
ar: البرامج الجديدة

source: Topics
ar: المواضيع

source: Alumni Search
ar: الخريجين

source: Enrolled Programs
ar: البرامج المسجلة

source: Projects
ar: المشاريع

source: Active Programs
ar: البرامج الحالية

source: Previous Programs
ar: البرامج السابقة

source: "\uFFFD#4\uFFFD"Active"\uFFFD/#4\uFFFD" Programs
ar: "\uFFFD#4\uFFFD"البرامج"\uFFFD/#4\uFFFD" الحالية

source: "\uFFFD#10\uFFFD"Previous"\uFFFD/#10\uFFFD" Programs
ar: "\uFFFD#10\uFFFD"البرامج"\uFFFD/#10\uFFFD" السابقة

source: Group Projects
ar: مشاريع جماعية

source: Please set the date and time of this session
ar: يرجى تحديد تاريخ الجلسة

source: Enter Joining Date
ar: أدخل تاريخ الانضمام

source: Joining Date
ar: تاريخ الانضمام

source: % is Completed
ar: % مكتمل

source: Newsfeed
ar: أحدث الأخبار

source: Start Date: "\uFFFD#16\uFFFD""\uFFFD0\uFFFD""\uFFFD/#16\uFFFD"
ar: تاريخ البدء

source: Cost: "\uFFFD0\uFFFD" AED
ar: كلفة

source: Short description
ar: وصف موجز للفكرة

source: Estimated Budget
ar: الميزانية التقديرية

source: Enter the body of the idea
ar: موضوع الفكرة

source: Enter the benchmark
ar: أدخل المعيار

source: Back to Elite Club
ar: العودة إلى نادي قادة دبي

source: Residence Country
ar: بلد الإقامة

source: Nationality:
ar: الجنسية:

source: Job Position
ar: المنصب الوظيفي

source: Add Idea
ar: فكرة المشروع الخاص

source: Topic
ar: المحور

source: Select a topic
ar: اختر المحور

source: Add Special Project Idea
ar: أضف فكرة المشروع الخاص

source: Add Material
ar: أضف مادة

source: Add Newsfeed
ar: اضف

source: Residence country:
ar: بلد الإقامة:

source: Enter Topic
ar: اختر المحور

source: Select a status
ar: اختر الحالة

source: Add Newsfeed Content
ar: أضف أحدث الأخبار

source: Expire at
ar: انتهاء الصلاحية في

source: Enter expire date
ar: أدخل تاريخ انتهاء الصلاحية

source: Stick note text
ar: نص الملاحظة اللاصقة

source: Text "\uFFFD#13\uFFFD"*"\uFFFD/#13\uFFFD"
ar: النص

source: Inform student
ar: إبلاغ الطالب

source: Enter the order
ar: أدخل الترتيب

source: Enter the duration
ar: أدخل المدة

source: Go back
ar: العودة

source: Article Photo
ar: صورة المقال

source: Enter the article photo
ar: أدخل صورة المقال

source: Emirates Id 'emirate' already exist.
ar: الهوية الاماراتية مستخدمة من قبل

source: Emirates Id 'emirate' already exist.
ar: الهوية الاماراتية مستخدمة من قبل

source: Delete Account
ar: حذف الحساب

source: User deleted successfully.
ar: تم حذف المستخدم بنجاح

source: Are you sure you want to delete this account?
ar: هل انت متأكد ؟

source: Error
ar: حدث خطأ

source: Something is wrong.
ar: حدث خطأ

source: Confirmation
ar: تأكيد

source: Delete Account
ar: حذف الحساب

source: When you delete your account, you won't be able to retrieve the content or information you've shared on MBRCLD. Your profile and all of related data and contribution will also be deleted.
ar: عند حذف حسابك، لن تتمكن من استرداد المحتوى أو المعلومات التي قمت بمشاركتها وسيتم أيضًا حذف ملفك الشخصي وجميع البيانات ذات الصلة

source: When you delete your account, you won't be able to retrieve the content or information you've shared on MBRCLD. Your profile and all of related data and contribution will also be deleted. MBRCLD Team will reach out to you to confirm you request.
ar: عند حذف حسابك، لن تتمكن من استرداد المحتوى أو المعلومات التي قمت بمشاركتها وسيتم أيضًا حذف ملفك الشخصي وجميع البيانات ذات الصلة سيتواصل معك الفريق لتأكيد طلبك

# profileIsOutDated
source: Stay up-to-date and make the most of your portal experience by updating your profile every 6 months. Your profile is a reflection of who you are, and keeping it current helps us provide you with the best personalized services and opportunities.
ar: ابقَ على اطلاع دائم واستفد إلى أقصى حد من تجربة الموقع الإلكتروني عن طريق تحديث البيانات الشخصية الخاصة بك كل 6 أشهر. ملفك الشخصي هو انعكاس لمن أنت ، وإبقائه محدثًا يساعدنا على تزويدك بأفضل الخدمات والفرص المخصصة لك.

# programUploadVideoDescription
source: Please upload a 1-minute video introducing yourself!
ar: عرف عن نفسك عن طريق تحميل فيديو مدته دقيقة كحد اقصى

# programUploadVideoTitle
source: Upload Video
ar: تحميل الفيديو

# programUploadVideoUploaded
source: Video uploaded.
ar: تم تحميل الفيديو

# programUploadVideoMaxSize
source: Maximum upload size is
ar: أقصى حجم للتحميل هو

source: Event Registration
ar: حالة الفعاليات

# knowledgehub_scholarships
source: Scholarships
ar: المنح

# knowledgehub_active
source: ACTIVE
ar: المنح الحالية

# knowledgehub_previous
source: PREVIOUS
ar: المنح السابقة

# knowledgehub_registrationStatus
source: Scholarship Registration Status
ar: حالة التسجيل

source: To Date
ar: التاريخ

source: Register
ar: تسجيل

source: Already Registered
ar: مسجل
